{"text": "Digital identity explained Digital identity is essentially any personal data existing online that can be traced back to the real you. For example, photos you’ve uploaded to social media, posts you’ve created or commented on, your online bank account, search engine history… and yes, if you’re a gamer, your Steam account, too. Taking control of your digital identity Digital identities are here to stay. As long as your online Doppelganger exists, there will always be someone hoping to exploit it. However, there’s good news: you can take a few steps right now to quickly and easily decrease the chances of that ever happening. 1. Change to a search engine that respects privacy. Avast Secure Browser comes with advanced security that's built directly into your browser, allowing you to browse, shop, and bank safely on any website while protecting your privacy. 2. Protect your passwords using password managers. Simply put, password managers put strong encryption on your passwords and allow you to manage them in one place. In addition to several other cool things they offer, there’s an audit feature that checks for weak, duplicate, and old passwords. 3. Always use a VPN. A virtual private network (VPN) is software that establishes a secure connection between you and the server. Information moving between this connection is encrypted and cannot be read by your ISP. While this is a great start to concealing your browsing activities from your ISP, it does not hide the fact that you’re using a VPN. You can push that level of concealment even further if you use Avast Secure Browser’s built-in mobile VPN which makes itself appear to be just an ordinary site. Shout out to our engineering team for that one!"}
{"text": "What Is Digital Identity? Digital identity is the collection of data that represents a unique person or entity online. Digital identity includes demographic and behavioral information, including tracked online actions. Digital identity can include personally identifiable information (PII), but many digital identities do not include PII and are, instead, considered anonymous. Digital identity exclusive of PII can protect consumer privacy while providing valuable information to understand targeted audiences and individuals. Without Cookies, How Can Digital Advertisers Collect Digital Identities? Cookies used to be the default system of collecting digital identities. In a cookie-less world, there are three primary methodologies to gather digital identities, including: Cohort Models To Create Digital Identity Google has, perhaps, the most famous cohort model for tracking digital identities. The Google Federated Learning of Cohorts or FLoC is “a privacy-preserving mechanism for interest-based ad selection.” Based on browsing history, Google’s FLoC algorithm creates cohorts with shared interests without revealing any private information. The cohorts are then used by advertisers to serve relevant ads to the FLoC audiences. Cohort data, like Google FLoC data, can be combined with other third-party information to further understand audience preferences. “For example, an adtech platform might learn from an online shoe store that browsers from cohorts 1101 and 1354 seem interested in the store's hiking gear. From other advertisers, the adtech platform learns about other interests of those cohorts,” explains Google. Over time, cohorts can become more and more refined. Authenticated Digital Identity Authenticated digital identity relies on PII to identify individuals. Login information, like what’s used for apps or social media accounts, can represent authenticated digital identity. Because authenticated digital identity precisely identifies individuals, authenticated digital identity can be used for precise ad targeting. Recent updates that require opt ins for tracking, like the Apple iOS 14.5 update for the iPhone and iPad, are reducing access to authenticated digital identity. In fact, only 4% of users are opting in to be tracked. Non-Authenticated Digital Identity Non-authenticated digital identity, also called probabilistic data, does not leverage PII to identify individuals. Instead, non-authenticated digital identity pieces together bits of data, like IP addresses, to comprise what probably represents an individual. Probabilistic data can be useful for scale and prospecting."}
{"text": "Why Is Digital Identity Important For Digital Advertisers? Digital identity helps digital advertisers understand, target and engage audiences with high propensity to take action. Digital identity also helps digital advertisers nurture audiences and track campaign performance. Can Digital Advertising Be Effective Without Digital Identity Data? Yes, digital advertising can be effective without digital identity. Contextual targeting is a strategy that matches ads to content based on the context of the content. In addition to aligning ads with content in a way that makes sense for the audience viewing the ads, contextual targeting can support brand safety initiatives."}
{"text": "Digital identity defined Your digital identity consists of various pieces of information about you—in digital form—that, when put together, point to you. Such pieces of information are often called “data attributes.” They can be something obvious, such as a user name or Social Security number, or something less apparent, such as your online comments or search activities. You might regularly share some of your data attributes to make an online purchase or access your bank account, for instance. But if you share certain types of your personal data—such as your full name, date of birth, and Social Security number—and they're somehow exposed, you’re at risk of an identity thief using them to pretend to be you. In a world as technology-oriented as ours, it can be a challenge to limit not only what we share, but also how we share it. And even if you take every possible precaution, a data breach at a company with whom you do business could possibly result in identity theft. Still, it’s worth trying to stay on top of how you handle your personal information."}
{"text": "What are your digital attributes? We touched on a few of these earlier, but let’s take a look at some of the personal data that, either alone or when put together, can point in your direction. This can also include your online activity. Login credentials (usernames and passwords). Date of birth. Social Security number. Medical history. Online search activities. Online accounts. Comments on articles and social media. Likes, posts, reposts, and shares on social networks. Signed online petitions. How can you help protect your digital identity? There is no simple solution to keep your digital identity safe, but here are some tips that can help you protect some of the data attributes that make it up: Limit sharing your Social Security number—whether in a doctor’s office, at school, or online. Use strong and unique passwords on each of your online accounts. Make sure you’re on a secure network or using a VPN, a virtual private network, when banking, shopping or making other online transactions. Don’t share your login credentials with others. Shred documents containing personal information before discarding. Secure your home Wi-Fi network with a strong password."}