{"text": "Sustainability focuses on meeting the needs of the present without compromising the ability of future generations to meet their needs. The concept of sustainability is composed of three pillars: economic, environmental, and social—also known informally as profits, planet, and people. Increasingly, companies are making public commitments to sustainability through actions like reducing waste, investing in renewable energy, and supporting organizations that work toward a more sustainable future. How Sustainability Works Sustainability encourages businesses to frame decisions in terms of environmental, social, and human impact for the long-term, rather than on short-term gains such as next quarter's earnings report. It influences them to consider more factors than simply the immediate profit or loss involved. Increasingly, companies have issued sustainability goals such as commitment to zero-waste packaging by a certain year, or to reduce overall emissions by a certain percentage. These companies can achieve their sustainability needs by cutting emissions, lowering their energy usage, sourcing products from fair-trade organizations, and ensuring their physical waste is disposed of properly and with as small a carbon footprint as possible. Challenges Around Sustainability The push for sustainability is evident in areas such as energy generation where the focus has been on finding new deposits to outpace the drawdown on existing reserves. Some electricity companies, for example, now publicly state goals for energy generation from sustainable sources such as wind, hydropower, and solar. However, moving toward sustainable production is often a complex process for companies. By basing decisions on longer timelines, some of the higher upfront investments in efficiency and renewable sources are easier to justify. Investors have had to adjust their expectations for returns because a company that commits to the sustainable development of resources may have more modest earnings results in the near term. Many companies have been criticized for exploiting cost-cutting measures such as offshoring production to obtain cheaper labor. This practice, although beneficial for the bottom line, often comes at the price of compromised worker safety and security. One of the starkest examples of how offshoring can go wrong was the 2013 Savar factory collapse in Bangladesh, in which more than 1,100 people died. Other ways of cutting costs can also damage sustainability: For example, a factory that allows its waste to flow into a nearby body of water to avoid the short-term costs of proper disposal can cause expensive and significant long-term environmental damage. Many of the companies that are most sensitive to consumer backlash, usually retailers and restaurants, have announced sustainability plans to reduce carbon footprints, packaging waste, and animal suffering. This has caused some investors to shy away from sustainable investments—at least until companies become more transparent with their financial and business practices."}
{"text": "The definition of sustainability is the study of how natural systems function, remain diverse and produce everything it needs for the ecology to remain in balance. It also acknowledges that human civilisation takes resources to sustain our modern way of life. There are countless examples throughout human history where a civilisation has damaged its own environment and seriously affected its own survival chances (some of which Jared Diamond explores in his book Collapse: How Complex Societies Choose to Fail or Survive). Sustainability takes into account how we might live in harmony with the natural world around us, protecting it from damage and destruction. We now live in a modern, consumerist and largely urban existence throughout the developed world and we consume a lot of natural resources every day. In our urban centres, we consume more power than those who live in rural settings and urban centres use a lot more power than average, keeping our streets and civic buildings lit, to power our appliances, our heating and other public and household power requirements. That's not to say that sustainable living should only focus on people who live in urban centres though, there are improvements to be made everywhere - it is estimated that we use about 40% more resources every year than we can put back and that needs to change. Sustainability and sustainable development focuses on balancing that fine line between competing needs - our need to move forward technologically and economically, and the needs to protect the environments in which we and others live. Sustainability is not just about the environment, it's also about our health as a society in ensuring that no people or areas of life suffer as a result of environmental legislation, and it's also about examining the longer term effects of the actions humanity takes and asking questions about how it may be improved. "}