{"text": "History of sustainable fashion While it sounds trendy now, fashion has, historically, been sustainable. Think back to hundreds of years ago, when people only had a few articles of clothing that they made out of materials they had on-hand. Outside of nobility, people might have a set of clothes for church, a set of working clothes, and a set of house clothes. When they couldn’t wear their clothes anymore, they repurposed materials. Nothing was wasted. Fast forward a few hundred years, and we have clothes for every occasion imaginable. The instant a fashion trend emerges on the runway, it’s available in stores for a very low cost. And once the trend is over, we simply throw it away. What happened? The history of American fashion as we know it dates back to the 19th century, during the rise of the Industrial Revolution. This was when department stores were making their debut and fashion was moving from customized articles of clothing to mass-produced lines, thanks to the sewing machine and unfortunately lax labor laws. Consumerism hit its peak after World War II. The 1950s and 1960s saw a proliferation of strip malls and department stores. At this point, American clothes were still manufactured in the United States. That remained the norm until the late 20th century when the U.S. and other countries agreed to a quota system that limited how many textiles could be imported from other countries. The result was a rise in costs for domestic textile products. The quota system was replaced by a World Trade Organization agreement in 2005. This agreement made it significantly cheaper and easier to outsource the manufacturing of clothing overseas. Today, most American clothes are made in other countries—generally, third-world countries that have far less stringent regulations when it comes to important things like child labor laws and safe working environments. Why is sustainable fashion important? The increased production and consumption of fashion are ruining our planet. With more people than ever living on the planet, we need to find ways to use resources more responsibly. One way to do that is through sustainable fashion. Taking responsibility for where our clothing is sourced, how the people who make our clothing are being treated, and where our clothes end up when we no longer need or want them can be a big step toward tackling climate change. Fashion is the perfect starting point if you’re looking for ways to live more sustainably. Consider this. On average, Americans spend $350 billion a day shopping for clothes. That’s an enormous amount of money! If we give our dollars to companies that are rooted in sustainable practices and who give back through charitable contributions and volunteer work, then our money would be directly going toward improving conditions around the world. You can improve working conditions for the people who make your clothes by being choosy about what company you buy your clothes from. Even better, you don’t need to seek out these clothing companies for yourself. Places like DoneGood do the work for you to find eco-friendly manufacturers who are dedicated to using sustainable practices in sourcing, creating, and distributing their products. Finding sustainability in a fast fashion culture Today’s world is full of “fast fashion.” This has been a trend since the 1990s, with stores like H&M and Forever 21 popping up globally as affordable retailers for fashion-conscious consumers. With fast fashion, retailers move design trends from the catwalk to the store quickly and cheaply. You can buy a designer-inspired shirt for under $10—a price so cheap that most consumers don’t mind if they only wear it once or twice before throwing it away. Unfortunately, this means that clothes move from your closet to the trash at breakneck speed. This has a devastating impact on the planet, especially because fast fashion tends to use cheap (and toxic) textile dyes. In fact, the fashion industry is the second-largest source of clean water pollution in the world (the first is agriculture). Fashion materials and their global impact The materials used to create fast fashion articles are largely to blame for the environmental impacts fashion has. For instance, polyester, which is one of the more popular fabrics in fast fashion, is derived from fossil fuels. When you wash polyester, the material sheds microfibers that contribute to increasing levels of plastic in the world’s oceans. Even more natural materials are still hazardous. Take cotton, for example. Though it’s sourced more naturally than materials like polyester, it still wreaks havoc on the environment, particularly when it’s used at a fast-pace for fast fashion. Cotton requires huge quantities of water and pesticides. It’s usually sourced from developing countries. Growing cotton for fast fashion, even organic cotton, can result in drought, placing huge burdens on the communities who count on growing cotton for their livelihood. In addition to impacting people, growing materials for fast fashion places a huge strain on the environment. It can reduce soil quality and impact biodiversity. And this is all just for growing the materials. Keep in mind that fast fashion pieces aren’t meant to be timeless. They’re meant to be worn a few times and then thrown away. In just the U.K., an estimated 235 million articles of clothing were estimated to be sent to the landfill in Spring 2017. The human cost of fast fashion To make the most profit, a lot of companies are outsourcing the production of fast fashion to third-world countries. When done unsustainably, this can have a devastating human cost. Garment workers often work for low wages in dangerous environments. Farmers might be exposed to toxic chemicals that impact their health and the health of their families. This is all for the short-lived joy of wearing a trendy shirt once or twice. The concept of fast fashion induces a throwaway culture, in which we, as consumers, constantly feel the pressure to have “in the moment” fashion pieces. We end up buying more than we need and throwing away more than the Earth can sustain. It’s a terrible cycle, and it needs to stop. Forms of more sustainable fashion The good news is that you aren’t doomed to participate in the shortened life cycle of fashion forever. More fashion companies are finding ways to ethically source clothing. This reduces harm to the environment and empowers the farmers and garment workers instead of hurting them. "}